## Plan Result (stg-frontdoor)




<pre><code>Plan: 0 to add, 26 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_resource_group.fd_rg
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;c100-application&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pip-frontend&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pip-frontend-b2c-sign-in&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;pip-frontend-b2c-staff&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;portal-stg&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;sds-api-mgmt&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-casetracker&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-certificatedbailiffs&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-courtfines&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-immigrationappealsonline&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-admin-appeals&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-care-standards&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-cicap&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-employment-appeals&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-finance-tax&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-immigration-svcs&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-info-rights&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-land-reg-division&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-lands-chamber&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;staging-trib-tansport-appeals&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;toffee&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-admin-web&#34;]
  * module.landing_zone.azurerm_frontdoor_firewall_policy.custom[&#34;vh-video-web&#34;]
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.fd_rg will be updated in-place
  ~ resource "azurerm_resource_group" "fd_rg" {
        id       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg"
        name     = "lz-stg-rg"
      ~ tags     = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoors/sdshmcts-stg"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoors/sdshmcts-stg"
        name                                 = "sdshmcts-stg"
      ~ tags                                 = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (135 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["c100-application"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/c100applicationstg"
        name                              = "c100applicationstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pip-frontend"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/pipfrontendstg"
        name                              = "pipfrontendstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

      ~ managed_rule {
            # (2 unchanged attributes hidden)

          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "code"
            }
          + exclusion {
              + match_variable = "QueryStringArgNames"
              + operator       = "Equals"
              + selector       = "client_id"
            }

            # (9 unchanged blocks hidden)
        }
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pip-frontend-b2c-sign-in"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/pipfrontendb2csigninstg"
        name                              = "pipfrontendb2csigninstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["pip-frontend-b2c-staff"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/pipfrontendb2cstaffstg"
        name                              = "pipfrontendb2cstaffstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["portal-stg"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/portalstgstg"
        name                              = "portalstgstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["sds-api-mgmt"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/sdsapimgmtstg"
        name                              = "sdsapimgmtstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-casetracker"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingcasetrackerstg"
        name                              = "stagingcasetrackerstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-certificatedbailiffs"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingcertificatedbailiffsstg"
        name                              = "stagingcertificatedbailiffsstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-courtfines"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingcourtfinesstg"
        name                              = "stagingcourtfinesstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-immigrationappealsonline"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingimmigrationappealsonlinestg"
        name                              = "stagingimmigrationappealsonlinestg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-trib-admin-appeals"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribadminappealsstg"
        name                              = "stagingtribadminappealsstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-trib-care-standards"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribcarestandardsstg"
        name                              = "stagingtribcarestandardsstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-trib-cicap"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribcicapstg"
        name                              = "stagingtribcicapstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-trib-employment-appeals"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribemploymentappealsstg"
        name                              = "stagingtribemploymentappealsstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-trib-finance-tax"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribfinancetaxstg"
        name                              = "stagingtribfinancetaxstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-trib-immigration-svcs"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribimmigrationsvcsstg"
        name                              = "stagingtribimmigrationsvcsstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-trib-info-rights"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribinforightsstg"
        name                              = "stagingtribinforightsstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-trib-land-reg-division"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtriblandregdivisionstg"
        name                              = "stagingtriblandregdivisionstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-trib-lands-chamber"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtriblandschamberstg"
        name                              = "stagingtriblandschamberstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["staging-trib-tansport-appeals"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/stagingtribtansportappealsstg"
        name                              = "stagingtribtansportappealsstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["toffee"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/toffeestg"
        name                              = "toffeestg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-admin-web"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhadminwebstg"
        name                              = "vhadminwebstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_frontdoor_firewall_policy.custom["vh-video-web"] will be updated in-place
  ~ resource "azurerm_frontdoor_firewall_policy" "custom" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/vhvideowebstg"
        name                              = "vhvideowebstg"
      ~ tags                              = {
          - "autoShutdown" = "false" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/lz-stg-rg/providers/Microsoft.Network/frontDoors/sdshmcts-stg|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category       = (known after apply)
          + category_group = (known after apply)
          + enabled        = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 26 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":346,"Program":"tfcmt","SHA1":"","Target":"stg-frontdoor","Vars":{}} -->